RT-Thread/rt-thread/bsp/msp432e401y-LaunchPad/libraries/msp432e4/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the FPU API.
//
//*****************************************************************************
#ifdef ROM_FPUEnable
#define MAP_FPUEnable                                                         \
        ROM_FPUEnable
#else
#define MAP_FPUEnable                                                         \
        FPUEnable
#endif
#ifdef ROM_FPUDisable
#define MAP_FPUDisable                                                        \
        ROM_FPUDisable
#else
#define MAP_FPUDisable                                                        \
        FPUDisable
#endif
#ifdef ROM_FPUFlushToZeroModeSet
#define MAP_FPUFlushToZeroModeSet                                             \
        ROM_FPUFlushToZeroModeSet
#else
#define MAP_FPUFlushToZeroModeSet                                             \
        FPUFlushToZeroModeSet
#endif
#ifdef ROM_FPUHalfPrecisionModeSet
#define MAP_FPUHalfPrecisionModeSet                                           \
        ROM_FPUHalfPrecisionModeSet
#else
#define MAP_FPUHalfPrecisionModeSet                                           \
        FPUHalfPrecisionModeSet
#endif
#ifdef ROM_FPULazyStackingEnable
#define MAP_FPULazyStackingEnable                                             \
        ROM_FPULazyStackingEnable
#else
#define MAP_FPULazyStackingEnable                                             \
        FPULazyStackingEnable
#endif
#ifdef ROM_FPUNaNModeSet
#define MAP_FPUNaNModeSet                                                     \
        ROM_FPUNaNModeSet
#else
#define MAP_FPUNaNModeSet                                                     \
        FPUNaNModeSet
#endif
#ifdef ROM_FPURoundingModeSet
#define MAP_FPURoundingModeSet                                                \
        ROM_FPURoundingModeSet
#else
#define MAP_FPURoundingModeSet                                                \
        FPURoundingModeSet
#endif
#ifdef ROM_FPUStackingDisable
#define MAP_FPUStackingDisable                                                \
        ROM_FPUStackingDisable
#else
#define MAP_FPUStackingDisable                                                \
        FPUStackingDisable
#endif
#ifdef ROM_FPUStackingEnable
#define MAP_FPUStackingEnable                                                 \
        ROM_FPUStackingEnable
#else
#define MAP_FPUStackingEnable                                                 \
        FPUStackingEnable
#endif

//*****************************************************************************
//
// Macros for the GPIO API.
//
//*****************************************************************************
#ifdef ROM_GPIOPinWrite
#define MAP_GPIOPinWrite                                                      \
        ROM_GPIOPinWrite
#else
#define MAP_GPIOPinWrite                                                      \
        GPIOPinWrite
#endif
#ifdef ROM_GPIODirModeSet
#define MAP_GPIODirModeSet                                                    \
        ROM_GPIODirModeSet
#else
#define MAP_GPIODirModeSet                                                    \
        GPIODirModeSet
#endif
#ifdef ROM_GPIODirModeGet
#define MAP_GPIODirModeGet                                                    \
        ROM_GPIODirModeGet
#else
#define MAP_GPIODirModeGet                                                    \
        GPIODirModeGet
#endif
#ifdef ROM_GPIOIntTypeSet
#define MAP_GPIOIntTypeSet                                                    \
        ROM_GPIOIntTypeSet
#else
#define MAP_GPIOIntTypeSet                                                    \
        GPIOIntTypeSet
#endif
#ifdef ROM_GPIOIntTypeGet
#define MAP_GPIOIntTypeGet                                                    \
        ROM_GPIOIntTypeGet
#else
#define MAP_GPIOIntTypeGet                                                    \
        GPIOIntTypeGet
#endif
#ifdef ROM_GPIOPadConfigSet
#define MAP_GPIOPadConfigSet                                                  \
        ROM_GPIOPadConfigSet
#else
#define MAP_GPIOPadConfigSet                                                  \
        GPIOPadConfigSet
#endif
#ifdef ROM_GPIOPadConfigGet
#define MAP_GPIOPadConfigGet                                                  \
        ROM_GPIOPadConfigGet
#else
#define MAP_GPIOPadConfigGet                                                  \
        GPIOPadConfigGet
#endif
#ifdef ROM_GPIOPinRead
#define MAP_GPIOPinRead                                                       \
        ROM_GPIOPinRead
#else
#define MAP_GPIOPinRead                                                       \
        GPIOPinRead
#endif
#ifdef ROM_GPIOPinTypeCAN
#define MAP_GPIOPinTypeCAN                                                    \
        ROM_GPIOPinTypeCAN
#else
#define MAP_GPIOPinTypeCAN                                                    \
        GPIOPinTypeCAN
#endif
#ifdef ROM_GPIOPinTypeComparator
#define MAP_GPIOPinTypeComparator                                             \
        ROM_GPIOPinTypeComparator
#else
#define MAP_GPIOPinTypeComparator                                             \
        GPIOPinTypeComparator
#endif
#ifdef ROM_GPIOPinTypeComparatorOutput
#define MAP_GPIOPinTypeComparatorOutput                                       \
        ROM_GPIOPinTypeComparatorOutput
#else
#define MAP_GPIOPinTypeComparatorOutput                                       \
        GPIOPinTypeComparatorOutput
#endif
#ifdef ROM_GPIOPinTypeEPI
#define MAP_GPIOPinTypeEPI                                                    \
        ROM_GPIOPinTypeEPI
#else
#define MAP_GPIOPinTypeEPI                                                    \
        GPIOPinTypeEPI
#endif
#ifdef ROM_GPIOPinTypeGPIOInput
#define MAP_GPIOPinTypeGPIOInput                                              \
        ROM_GPIOPinTypeGPIOInput
#else
#define MAP_GPIOPinTypeGPIOInput                                              \
        GPIOPinTypeGPIOInput
#endif
#ifdef ROM_GPIOPinTypeGPIOOutput
#define MAP_GPIOPinTypeGPIOOutput                                             \
        ROM_GPIOPinTypeGPIOOutput
#else
#define MAP_GPIOPinTypeGPIOOutput                                             \
        GPIOPinTypeGPIOOutput
#endif
#ifdef ROM_GPIOPinTypeI2C
#define MAP_GPIOPinTypeI2C                                                    \
        ROM_GPIOPinTypeI2C
#else
#define MAP_GPIOPinTypeI2C                                                    \
        GPIOPinTypeI2C
#endif
#ifdef ROM_GPIOPinTypePWM
#define MAP_GPIOPinTypePWM                                                    \
        ROM_GPIOPinTypePWM
#else
#define MAP_GPIOPinTypePWM                                                    \
        GPIOPinTypePWM
#endif
#ifdef ROM_GPIOPinTypeQEI
#define MAP_GPIOPinTypeQEI                                                    \
        ROM_GPIOPinTypeQEI
#else
#define MAP_GPIOPinTypeQEI                                                    \
        GPIOPinTypeQEI
#endif
#ifdef ROM_GPIOPinTypeSSI
#define MAP_GPIOPinTypeSSI                                                    \
        ROM_GPIOPinTypeSSI
#else
#define MAP_GPIOPinTypeSSI                                                    \
        GPIOPinTypeSSI
#endif
#ifdef ROM_GPIOPinTypeTimer
#define MAP_GPIOPinTypeTimer                                                  \
        ROM_GPIOPinTypeTimer
#else
#define MAP_GPIOPinTypeTimer                                                  \
        GPIOPinTypeTimer
#endif
#ifdef ROM_GPIOPinTypeUART
#define MAP_GPIOPinTypeUART                                                   \
        ROM_GPIOPinTypeUART
#else
#define MAP_GPIOPinTypeUART                                                   \
        GPIOPinTypeUART
#endif
#ifdef ROM_GPIOPinTypeGPIOOutputOD
#define MAP_GPIOPinTypeGPIOOutputOD                                           \
        ROM_GPIOPinTypeGPIOOutputOD
#else
#define MAP_GPIOPinTypeGPIOOutputOD                                           \
        GPIOPinTypeGPIOOutputOD
#endif
#ifdef ROM_GPIOPinTypeADC
#define MAP_GPIOPinTypeADC                                                    \
        ROM_GPIOPinTypeADC
#else
#define MAP_GPIOPinTypeADC                                                    \
        GPIOPinTypeADC
#endif
#ifdef ROM_GPIOPinTypeUSBDigital
#define MAP_GPIOPinTypeUSBDigital                                             \
        ROM_GPIOPinTypeUSBDigital
#else
#define MAP_GPIOPinTypeUSBDigital                                             \
        GPIOPinTypeUSBDigital
#endif
#ifdef ROM_GPIOPinConfigure
#define MAP_GPIOPinConfigure                                                  \
        ROM_GPIOPinConfigure
#else
#define MAP_GPIOPinConfigure                                                  \
        GPIOPinConfigure
#endif
#ifdef ROM_GPIOPinTypeUSBAnalog
#define MAP_GPIOPinTypeUSBAnalog                                              \
        ROM_GPIOPinTypeUSBAnalog
#else
#define MAP_GPIOPinTypeUSBAnalog                                              \
        GPIOPinTypeUSBAnalog
#endif
#ifdef ROM_GPIODMATriggerEnable
#define MAP_GPIODMATriggerEnable                                              \
        ROM_GPIODMATriggerEnable
#else
#define MAP_GPIODMATriggerEnable                                              \
        GPIODMATriggerEnable
#endif
#ifdef ROM_GPIODMATriggerDisable
#define MAP_GPIODMATriggerDisable                                             \
        ROM_GPIODMATriggerDisable
#else
#define MAP_GPIODMATriggerDisable                                             \
        GPIODMATriggerDisable
#endif
#ifdef ROM_GPIOADCTriggerEnable
#define MAP_GPIOADCTriggerEnable                                              \
        ROM_GPIOADCTriggerEnable
#else
#define MAP_GPIOADCTriggerEnable                                              \
        GPIOADCTriggerEnable
#endif
#ifdef ROM_GPIOADCTriggerDisable
#define MAP_GPIOADCTriggerDisable                                             \
        ROM_GPIOADCTriggerDisable
#else
#define MAP_GPIOADCTriggerDisable                                             \
        GPIOADCTriggerDisable
#endif
#ifdef ROM_GPIOPinTypeI2CSCL
#define MAP_GPIOPinTypeI2CSCL                                                 \
        ROM_GPIOPinTypeI2CSCL
#else
#define MAP_GPIOPinTypeI2CSCL                                                 \
        GPIOPinTypeI2CSCL
#endif
#ifdef ROM_GPIOPinTypeOneWire
#define MAP_GPIOPinTypeOneWire                                                \
        ROM_GPIOPinTypeOneWire
#else
#define MAP_GPIOPinTypeOneWire                                                \
        GPIOPinTypeOneWire
#endif
#ifdef ROM_GPIOPinTypeWakeHigh
#define MAP_GPIOPinTypeWakeHigh                                               \
        ROM_GPIOPinTypeWakeHigh
#else
#define MAP_GPIOPinTypeWakeHigh                                               \
        GPIOPinTypeWakeHigh
#endif
#ifdef ROM_GPIOPinTypeWakeLow
#define MAP_GPIOPinTypeWakeLow                                                \
        ROM_GPIOPinTypeWakeLow
#else
#define MAP_GPIOPinTypeWakeLow                                                \
        GPIOPinTypeWakeLow
#endif
#ifdef ROM_GPIOIntClear
#define MAP_GPIOIntClear                                                      \
        ROM_GPIOIntClear
#else
#define MAP_GPIOIntClear                                                      \
        GPIOIntClear
#endif
#ifdef ROM_GPIOIntDisable
#define MAP_GPIOIntDisable                                                    \
        ROM_GPIOIntDisable
#else
#define MAP_GPIOIntDisable                                                    \
        GPIOIntDisable
#endif
#ifdef ROM_GPIOIntEnable
#define MAP_GPIOIntEnable                                                     \
        ROM_GPIOIntEnable
#else
#define MAP_GPIOIntEnable                                                     \
        GPIOIntEnable
#endif
#ifdef ROM_GPIOIntStatus
#define MAP_GPIOIntStatus                                                     \
        ROM_GPIOIntStatus
#else
#define MAP_GPIOIntStatus                                                     \
        GPIOIntStatus
#endif
#ifdef ROM_GPIOPinWakeStatus
#define MAP_GPIOPinWakeStatus                                                 \
        ROM_GPIOPinWakeStatus
#else
#define MAP_GPIOPinWakeStatus                                                 \
        GPIOPinWakeStatus
#endif

