RT-Thread/rt-thread/bsp/msp432e401y-LaunchPad/libraries/msp432e4/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the uDMA API.
//
//*****************************************************************************
#ifdef ROM_uDMAInit
#define MAP_uDMAInit                                                          \
        ROM_uDMAInit
#else
#define MAP_uDMAInit                                                          \
        uDMAInit
#endif
#ifdef ROM_uDMAChannelTransferSet
#define MAP_uDMAChannelTransferSet                                            \
        ROM_uDMAChannelTransferSet
#else
#define MAP_uDMAChannelTransferSet                                            \
        uDMAChannelTransferSet
#endif
#ifdef ROM_uDMAEnable
#define MAP_uDMAEnable                                                        \
        ROM_uDMAEnable
#else
#define MAP_uDMAEnable                                                        \
        uDMAEnable
#endif
#ifdef ROM_uDMADisable
#define MAP_uDMADisable                                                       \
        ROM_uDMADisable
#else
#define MAP_uDMADisable                                                       \
        uDMADisable
#endif
#ifdef ROM_uDMAErrorStatusGet
#define MAP_uDMAErrorStatusGet                                                \
        ROM_uDMAErrorStatusGet
#else
#define MAP_uDMAErrorStatusGet                                                \
        uDMAErrorStatusGet
#endif
#ifdef ROM_uDMAErrorStatusClear
#define MAP_uDMAErrorStatusClear                                              \
        ROM_uDMAErrorStatusClear
#else
#define MAP_uDMAErrorStatusClear                                              \
        uDMAErrorStatusClear
#endif
#ifdef ROM_uDMAChannelEnable
#define MAP_uDMAChannelEnable                                                 \
        ROM_uDMAChannelEnable
#else
#define MAP_uDMAChannelEnable                                                 \
        uDMAChannelEnable
#endif
#ifdef ROM_uDMAChannelDisable
#define MAP_uDMAChannelDisable                                                \
        ROM_uDMAChannelDisable
#else
#define MAP_uDMAChannelDisable                                                \
        uDMAChannelDisable
#endif
#ifdef ROM_uDMAChannelIsEnabled
#define MAP_uDMAChannelIsEnabled                                              \
        ROM_uDMAChannelIsEnabled
#else
#define MAP_uDMAChannelIsEnabled                                              \
        uDMAChannelIsEnabled
#endif
#ifdef ROM_uDMAControlBaseSet
#define MAP_uDMAControlBaseSet                                                \
        ROM_uDMAControlBaseSet
#else
#define MAP_uDMAControlBaseSet                                                \
        uDMAControlBaseSet
#endif
#ifdef ROM_uDMAControlBaseGet
#define MAP_uDMAControlBaseGet                                                \
        ROM_uDMAControlBaseGet
#else
#define MAP_uDMAControlBaseGet                                                \
        uDMAControlBaseGet
#endif
#ifdef ROM_uDMAChannelRequest
#define MAP_uDMAChannelRequest                                                \
        ROM_uDMAChannelRequest
#else
#define MAP_uDMAChannelRequest                                                \
        uDMAChannelRequest
#endif
#ifdef ROM_uDMAChannelAttributeEnable
#define MAP_uDMAChannelAttributeEnable                                        \
        ROM_uDMAChannelAttributeEnable
#else
#define MAP_uDMAChannelAttributeEnable                                        \
        uDMAChannelAttributeEnable
#endif
#ifdef ROM_uDMAChannelAttributeDisable
#define MAP_uDMAChannelAttributeDisable                                       \
        ROM_uDMAChannelAttributeDisable
#else
#define MAP_uDMAChannelAttributeDisable                                       \
        uDMAChannelAttributeDisable
#endif
#ifdef ROM_uDMAChannelAttributeGet
#define MAP_uDMAChannelAttributeGet                                           \
        ROM_uDMAChannelAttributeGet
#else
#define MAP_uDMAChannelAttributeGet                                           \
        uDMAChannelAttributeGet
#endif
#ifdef ROM_uDMAChannelControlSet
#define MAP_uDMAChannelControlSet                                             \
        ROM_uDMAChannelControlSet
#else
#define MAP_uDMAChannelControlSet                                             \
        uDMAChannelControlSet
#endif
#ifdef ROM_uDMAChannelSizeGet
#define MAP_uDMAChannelSizeGet                                                \
        ROM_uDMAChannelSizeGet
#else
#define MAP_uDMAChannelSizeGet                                                \
        uDMAChannelSizeGet
#endif
#ifdef ROM_uDMAChannelModeGet
#define MAP_uDMAChannelModeGet                                                \
        ROM_uDMAChannelModeGet
#else
#define MAP_uDMAChannelModeGet                                                \
        uDMAChannelModeGet
#endif
#ifdef ROM_uDMAControlAlternateBaseGet
#define MAP_uDMAControlAlternateBaseGet                                       \
        ROM_uDMAControlAlternateBaseGet
#else
#define MAP_uDMAControlAlternateBaseGet                                       \
        uDMAControlAlternateBaseGet
#endif
#ifdef ROM_uDMAChannelScatterGatherSet
#define MAP_uDMAChannelScatterGatherSet                                       \
        ROM_uDMAChannelScatterGatherSet
#else
#define MAP_uDMAChannelScatterGatherSet                                       \
        uDMAChannelScatterGatherSet
#endif
#ifdef ROM_uDMAChannelAssign
#define MAP_uDMAChannelAssign                                                 \
        ROM_uDMAChannelAssign
#else
#define MAP_uDMAChannelAssign                                                 \
        uDMAChannelAssign
#endif

//*****************************************************************************
//
// Macros for the USB API.
//
//*****************************************************************************
#ifdef ROM_USBDevAddrGet
#define MAP_USBDevAddrGet                                                     \
        ROM_USBDevAddrGet
#else
#define MAP_USBDevAddrGet                                                     \
        USBDevAddrGet
#endif
#ifdef ROM_USBDevAddrSet
#define MAP_USBDevAddrSet                                                     \
        ROM_USBDevAddrSet
#else
#define MAP_USBDevAddrSet                                                     \
        USBDevAddrSet
#endif
#ifdef ROM_USBDevConnect
#define MAP_USBDevConnect                                                     \
        ROM_USBDevConnect
#else
#define MAP_USBDevConnect                                                     \
        USBDevConnect
#endif
#ifdef ROM_USBDevDisconnect
#define MAP_USBDevDisconnect                                                  \
        ROM_USBDevDisconnect
#else
#define MAP_USBDevDisconnect                                                  \
        USBDevDisconnect
#endif
#ifdef ROM_USBDevEndpointConfigSet
#define MAP_USBDevEndpointConfigSet                                           \
        ROM_USBDevEndpointConfigSet
#else
#define MAP_USBDevEndpointConfigSet                                           \
        USBDevEndpointConfigSet
#endif
#ifdef ROM_USBDevEndpointDataAck
#define MAP_USBDevEndpointDataAck                                             \
        ROM_USBDevEndpointDataAck
#else
#define MAP_USBDevEndpointDataAck                                             \
        USBDevEndpointDataAck
#endif
#ifdef ROM_USBDevEndpointStall
#define MAP_USBDevEndpointStall                                               \
        ROM_USBDevEndpointStall
#else
#define MAP_USBDevEndpointStall                                               \
        USBDevEndpointStall
#endif
#ifdef ROM_USBDevEndpointStallClear
#define MAP_USBDevEndpointStallClear                                          \
        ROM_USBDevEndpointStallClear
#else
#define MAP_USBDevEndpointStallClear                                          \
        USBDevEndpointStallClear
#endif
#ifdef ROM_USBDevEndpointStatusClear
#define MAP_USBDevEndpointStatusClear                                         \
        ROM_USBDevEndpointStatusClear
#else
#define MAP_USBDevEndpointStatusClear                                         \
        USBDevEndpointStatusClear
#endif
#ifdef ROM_USBEndpointDataGet
#define MAP_USBEndpointDataGet                                                \
        ROM_USBEndpointDataGet
#else
#define MAP_USBEndpointDataGet                                                \
        USBEndpointDataGet
#endif
#ifdef ROM_USBEndpointDataPut
#define MAP_USBEndpointDataPut                                                \
        ROM_USBEndpointDataPut
#else
#define MAP_USBEndpointDataPut                                                \
        USBEndpointDataPut
#endif
#ifdef ROM_USBEndpointDataSend
#define MAP_USBEndpointDataSend                                               \
        ROM_USBEndpointDataSend
#else
#define MAP_USBEndpointDataSend                                               \
        USBEndpointDataSend
#endif
#ifdef ROM_USBEndpointDataToggleClear
#define MAP_USBEndpointDataToggleClear                                        \
        ROM_USBEndpointDataToggleClear
#else
#define MAP_USBEndpointDataToggleClear                                        \
        USBEndpointDataToggleClear
#endif
#ifdef ROM_USBEndpointStatus
#define MAP_USBEndpointStatus                                                 \
        ROM_USBEndpointStatus
#else
#define MAP_USBEndpointStatus                                                 \
        USBEndpointStatus
#endif
#ifdef ROM_USBFIFOAddrGet
#define MAP_USBFIFOAddrGet                                                    \
        ROM_USBFIFOAddrGet
#else
#define MAP_USBFIFOAddrGet                                                    \
        USBFIFOAddrGet
#endif
#ifdef ROM_USBFIFOConfigGet
#define MAP_USBFIFOConfigGet                                                  \
        ROM_USBFIFOConfigGet
#else
#define MAP_USBFIFOConfigGet                                                  \
        USBFIFOConfigGet
#endif
#ifdef ROM_USBFIFOConfigSet
#define MAP_USBFIFOConfigSet                                                  \
        ROM_USBFIFOConfigSet
#else
#define MAP_USBFIFOConfigSet                                                  \
        USBFIFOConfigSet
#endif
#ifdef ROM_USBFIFOFlush
#define MAP_USBFIFOFlush                                                      \
        ROM_USBFIFOFlush
#else
#define MAP_USBFIFOFlush                                                      \
        USBFIFOFlush
#endif
#ifdef ROM_USBFrameNumberGet
#define MAP_USBFrameNumberGet                                                 \
        ROM_USBFrameNumberGet
#else
#define MAP_USBFrameNumberGet                                                 \
        USBFrameNumberGet
#endif
#ifdef ROM_USBHostAddrGet
#define MAP_USBHostAddrGet                                                    \
        ROM_USBHostAddrGet
#else
#define MAP_USBHostAddrGet                                                    \
        USBHostAddrGet
#endif
#ifdef ROM_USBHostAddrSet
#define MAP_USBHostAddrSet                                                    \
        ROM_USBHostAddrSet
#else
#define MAP_USBHostAddrSet                                                    \
        USBHostAddrSet
#endif
#ifdef ROM_USBHostEndpointConfig
#define MAP_USBHostEndpointConfig                                             \
        ROM_USBHostEndpointConfig
#else
#define MAP_USBHostEndpointConfig                                             \
        USBHostEndpointConfig
#endif
#ifdef ROM_USBHostEndpointDataAck
#define MAP_USBHostEndpointDataAck                                            \
        ROM_USBHostEndpointDataAck
#else
#define MAP_USBHostEndpointDataAck                                            \
        USBHostEndpointDataAck
#endif
#ifdef ROM_USBHostEndpointDataToggle
#define MAP_USBHostEndpointDataToggle                                         \
        ROM_USBHostEndpointDataToggle
#else
#define MAP_USBHostEndpointDataToggle                                         \
        USBHostEndpointDataToggle
#endif
#ifdef ROM_USBHostEndpointStatusClear
#define MAP_USBHostEndpointStatusClear                                        \
        ROM_USBHostEndpointStatusClear
#else
#define MAP_USBHostEndpointStatusClear                                        \
        USBHostEndpointStatusClear
#endif
#ifdef ROM_USBHostHubAddrGet
#define MAP_USBHostHubAddrGet                                                 \
        ROM_USBHostHubAddrGet
#else
#define MAP_USBHostHubAddrGet                                                 \
        USBHostHubAddrGet
#endif
#ifdef ROM_USBHostHubAddrSet
#define MAP_USBHostHubAddrSet                                                 \
        ROM_USBHostHubAddrSet
#else
#define MAP_USBHostHubAddrSet                                                 \
        USBHostHubAddrSet
#endif
#ifdef ROM_USBHostPwrDisable
#define MAP_USBHostPwrDisable                                                 \
        ROM_USBHostPwrDisable
#else
#define MAP_USBHostPwrDisable                                                 \
        USBHostPwrDisable
#endif
#ifdef ROM_USBHostPwrEnable
#define MAP_USBHostPwrEnable                                                  \
        ROM_USBHostPwrEnable
#else
#define MAP_USBHostPwrEnable                                                  \
        USBHostPwrEnable
#endif
#ifdef ROM_USBHostPwrConfig
#define MAP_USBHostPwrConfig                                                  \
        ROM_USBHostPwrConfig
#else
#define MAP_USBHostPwrConfig                                                  \
        USBHostPwrConfig
#endif
#ifdef ROM_USBHostPwrFaultDisable
#define MAP_USBHostPwrFaultDisable                                            \
        ROM_USBHostPwrFaultDisable
#else
#define MAP_USBHostPwrFaultDisable                                            \
        USBHostPwrFaultDisable
#endif
#ifdef ROM_USBHostPwrFaultEnable
#define MAP_USBHostPwrFaultEnable                                             \
        ROM_USBHostPwrFaultEnable
#else
#define MAP_USBHostPwrFaultEnable                                             \
        USBHostPwrFaultEnable
#endif
#ifdef ROM_USBHostRequestIN
#define MAP_USBHostRequestIN                                                  \
        ROM_USBHostRequestIN
#else
#define MAP_USBHostRequestIN                                                  \
        USBHostRequestIN
#endif
#ifdef ROM_USBHostRequestStatus
#define MAP_USBHostRequestStatus                                              \
        ROM_USBHostRequestStatus
#else
#define MAP_USBHostRequestStatus                                              \
        USBHostRequestStatus
#endif
#ifdef ROM_USBHostReset
#define MAP_USBHostReset                                                      \
        ROM_USBHostReset
#else
#define MAP_USBHostReset                                                      \
        USBHostReset
#endif
#ifdef ROM_USBHostResume
#define MAP_USBHostResume                                                     \
        ROM_USBHostResume
#else
#define MAP_USBHostResume                                                     \
        USBHostResume
#endif
#ifdef ROM_USBHostSpeedGet
#define MAP_USBHostSpeedGet                                                   \
        ROM_USBHostSpeedGet
#else
#define MAP_USBHostSpeedGet                                                   \
        USBHostSpeedGet
#endif
#ifdef ROM_USBHostSuspend
#define MAP_USBHostSuspend                                                    \
        ROM_USBHostSuspend
#else
#define MAP_USBHostSuspend                                                    \
        USBHostSuspend
#endif
#ifdef ROM_USBDevEndpointConfigGet
#define MAP_USBDevEndpointConfigGet                                           \
        ROM_USBDevEndpointConfigGet
#else
#define MAP_USBDevEndpointConfigGet                                           \
        USBDevEndpointConfigGet
#endif
#ifdef ROM_USBEndpointDMAEnable
#define MAP_USBEndpointDMAEnable                                              \
        ROM_USBEndpointDMAEnable
#else
#define MAP_USBEndpointDMAEnable                                              \
        USBEndpointDMAEnable
#endif
#ifdef ROM_USBEndpointDMADisable
#define MAP_USBEndpointDMADisable                                             \
        ROM_USBEndpointDMADisable
#else
#define MAP_USBEndpointDMADisable                                             \
        USBEndpointDMADisable
#endif
#ifdef ROM_USBEndpointDataAvail
#define MAP_USBEndpointDataAvail                                              \
        ROM_USBEndpointDataAvail
#else
#define MAP_USBEndpointDataAvail                                              \
        USBEndpointDataAvail
#endif
#ifdef ROM_USBModeGet
#define MAP_USBModeGet                                                        \
        ROM_USBModeGet
#else
#define MAP_USBModeGet                                                        \
        USBModeGet
#endif
#ifdef ROM_USBIntDisableControl
#define MAP_USBIntDisableControl                                              \
        ROM_USBIntDisableControl
#else
#define MAP_USBIntDisableControl                                              \
        USBIntDisableControl
#endif
#ifdef ROM_USBIntEnableControl
#define MAP_USBIntEnableControl                                               \
        ROM_USBIntEnableControl
#else
#define MAP_USBIntEnableControl                                               \
        USBIntEnableControl
#endif
#ifdef ROM_USBIntStatusControl
#define MAP_USBIntStatusControl                                               \
        ROM_USBIntStatusControl
#else
#define MAP_USBIntStatusControl                                               \
        USBIntStatusControl
#endif
#ifdef ROM_USBIntDisableEndpoint
#define MAP_USBIntDisableEndpoint                                             \
        ROM_USBIntDisableEndpoint
#else
#define MAP_USBIntDisableEndpoint                                             \
        USBIntDisableEndpoint
#endif
#ifdef ROM_USBIntEnableEndpoint
#define MAP_USBIntEnableEndpoint                                              \
        ROM_USBIntEnableEndpoint
#else
#define MAP_USBIntEnableEndpoint                                              \
        USBIntEnableEndpoint
#endif
#ifdef ROM_USBIntStatusEndpoint
#define MAP_USBIntStatusEndpoint                                              \
        ROM_USBIntStatusEndpoint
#else
#define MAP_USBIntStatusEndpoint                                              \
        USBIntStatusEndpoint
#endif
#ifdef ROM_USBHostMode
#define MAP_USBHostMode                                                       \
        ROM_USBHostMode
#else
#define MAP_USBHostMode                                                       \
        USBHostMode
#endif
#ifdef ROM_USBDevMode
#define MAP_USBDevMode                                                        \
        ROM_USBDevMode
#else
#define MAP_USBDevMode                                                        \
        USBDevMode
#endif
#ifdef ROM_USBPHYPowerOff
#define MAP_USBPHYPowerOff                                                    \
        ROM_USBPHYPowerOff
#else
#define MAP_USBPHYPowerOff                                                    \
        USBPHYPowerOff
#endif
#ifdef ROM_USBPHYPowerOn
#define MAP_USBPHYPowerOn                                                     \
        ROM_USBPHYPowerOn
#else
#define MAP_USBPHYPowerOn                                                     \
        USBPHYPowerOn
#endif
#ifdef ROM_USBOTGMode
#define MAP_USBOTGMode                                                        \
        ROM_USBOTGMode
#else
#define MAP_USBOTGMode                                                        \
        USBOTGMode
#endif
#ifdef ROM_USBHostRequestINClear
#define MAP_USBHostRequestINClear                                             \
        ROM_USBHostRequestINClear
#else
#define MAP_USBHostRequestINClear                                             \
        USBHostRequestINClear
#endif
#ifdef ROM_USBNumEndpointsGet
#define MAP_USBNumEndpointsGet                                                \
        ROM_USBNumEndpointsGet
#else
#define MAP_USBNumEndpointsGet                                                \
        USBNumEndpointsGet
#endif
#ifdef ROM_USBClockDisable
#define MAP_USBClockDisable                                                   \
        ROM_USBClockDisable
#else
#define MAP_USBClockDisable                                                   \
        USBClockDisable
#endif
#ifdef ROM_USBClockEnable
#define MAP_USBClockEnable                                                    \
        ROM_USBClockEnable
#else
#define MAP_USBClockEnable                                                    \
        USBClockEnable
#endif
#ifdef ROM_USBDevLPMConfig
#define MAP_USBDevLPMConfig                                                   \
        ROM_USBDevLPMConfig
#else
#define MAP_USBDevLPMConfig                                                   \
        USBDevLPMConfig
#endif
#ifdef ROM_USBDevLPMDisable
#define MAP_USBDevLPMDisable                                                  \
        ROM_USBDevLPMDisable
#else
#define MAP_USBDevLPMDisable                                                  \
        USBDevLPMDisable
#endif
#ifdef ROM_USBDevLPMEnable
#define MAP_USBDevLPMEnable                                                   \
        ROM_USBDevLPMEnable
#else
#define MAP_USBDevLPMEnable                                                   \
        USBDevLPMEnable
#endif
#ifdef ROM_USBDevLPMRemoteWake
#define MAP_USBDevLPMRemoteWake                                               \
        ROM_USBDevLPMRemoteWake
#else
#define MAP_USBDevLPMRemoteWake                                               \
        USBDevLPMRemoteWake
#endif
#ifdef ROM_USBDevSpeedGet
#define MAP_USBDevSpeedGet                                                    \
        ROM_USBDevSpeedGet
#else
#define MAP_USBDevSpeedGet                                                    \
        USBDevSpeedGet
#endif
#ifdef ROM_USBDMAChannelAddressGet
#define MAP_USBDMAChannelAddressGet                                           \
        ROM_USBDMAChannelAddressGet
#else
#define MAP_USBDMAChannelAddressGet                                           \
        USBDMAChannelAddressGet
#endif
#ifdef ROM_USBDMAChannelAddressSet
#define MAP_USBDMAChannelAddressSet                                           \
        ROM_USBDMAChannelAddressSet
#else
#define MAP_USBDMAChannelAddressSet                                           \
        USBDMAChannelAddressSet
#endif
#ifdef ROM_USBDMAChannelConfigSet
#define MAP_USBDMAChannelConfigSet                                            \
        ROM_USBDMAChannelConfigSet
#else
#define MAP_USBDMAChannelConfigSet                                            \
        USBDMAChannelConfigSet
#endif
#ifdef ROM_USBDMAChannelDisable
#define MAP_USBDMAChannelDisable                                              \
        ROM_USBDMAChannelDisable
#else
#define MAP_USBDMAChannelDisable                                              \
        USBDMAChannelDisable
#endif
#ifdef ROM_USBDMAChannelEnable
#define MAP_USBDMAChannelEnable                                               \
        ROM_USBDMAChannelEnable
#else
#define MAP_USBDMAChannelEnable                                               \
        USBDMAChannelEnable
#endif
#ifdef ROM_USBDMAChannelIntDisable
#define MAP_USBDMAChannelIntDisable                                           \
        ROM_USBDMAChannelIntDisable
#else
#define MAP_USBDMAChannelIntDisable                                           \
        USBDMAChannelIntDisable
#endif
#ifdef ROM_USBDMAChannelIntEnable
